TexasInstruments/c2000ware-core-sdk/device_support/f2806x/MWare/inc/hw_usb.h
//
// Defines for the bit fields in the USB_O_TXFUNCADDR3
// register.
//
#define USB_TXFUNCADDR3_ADDR_M  0x0000007F  // Device Address
#define USB_TXFUNCADDR3_ADDR_S  0

//
// Defines for the bit fields in the USB_O_TXHUBADDR3
// register.
//
#define USB_TXHUBADDR3_MULTTRAN 0x00000080  // Multiple Translators
#define USB_TXHUBADDR3_ADDR_M   0x0000007F  // Hub Address
#define USB_TXHUBADDR3_ADDR_S   0

//
// Defines for the bit fields in the USB_O_TXHUBPORT3
// register.
//
#define USB_TXHUBPORT3_PORT_M   0x0000007F  // Hub Port
#define USB_TXHUBPORT3_PORT_S   0

//
// Defines for the bit fields in the USB_O_RXFUNCADDR3
// register.
//
#define USB_RXFUNCADDR3_ADDR_M  0x0000007F  // Device Address
#define USB_RXFUNCADDR3_ADDR_S  0

//
// Defines for the bit fields in the USB_O_RXHUBADDR3
// register.
//
#define USB_RXHUBADDR3_MULTTRAN 0x00000080  // Multiple Translators
#define USB_RXHUBADDR3_ADDR_M   0x0000007F  // Hub Address
#define USB_RXHUBADDR3_ADDR_S   0

//
// Defines for the bit fields in the USB_O_RXHUBPORT3
// register.
//
#define USB_RXHUBPORT3_PORT_M   0x0000007F  // Hub Port
#define USB_RXHUBPORT3_PORT_S   0

//
// Defines for the bit fields in the USB_O_TXFUNCADDR4
// register.
//
#define USB_TXFUNCADDR4_ADDR_M  0x0000007F  // Device Address
#define USB_TXFUNCADDR4_ADDR_S  0

//
// Defines for the bit fields in the USB_O_TXHUBADDR4
// register.
//
#define USB_TXHUBADDR4_MULTTRAN 0x00000080  // Multiple Translators
#define USB_TXHUBADDR4_ADDR_M   0x0000007F  // Hub Address
#define USB_TXHUBADDR4_ADDR_S   0

//
// Defines for the bit fields in the USB_O_TXHUBPORT4
// register.
//
#define USB_TXHUBPORT4_PORT_M   0x0000007F  // Hub Port
#define USB_TXHUBPORT4_PORT_S   0

//
// Defines for the bit fields in the USB_O_RXFUNCADDR4
// register.
//
#define USB_RXFUNCADDR4_ADDR_M  0x0000007F  // Device Address
#define USB_RXFUNCADDR4_ADDR_S  0

//
// Defines for the bit fields in the USB_O_RXHUBADDR4
// register.
//
#define USB_RXHUBADDR4_MULTTRAN 0x00000080  // Multiple Translators
#define USB_RXHUBADDR4_ADDR_M   0x0000007F  // Hub Address
#define USB_RXHUBADDR4_ADDR_S   0

//
// Defines for the bit fields in the USB_O_RXHUBPORT4
// register.
//
#define USB_RXHUBPORT4_PORT_M   0x0000007F  // Hub Port
#define USB_RXHUBPORT4_PORT_S   0

//
// Defines for the bit fields in the USB_O_TXFUNCADDR5
// register.
//
#define USB_TXFUNCADDR5_ADDR_M  0x0000007F  // Device Address
#define USB_TXFUNCADDR5_ADDR_S  0

//
// Defines for the bit fields in the USB_O_TXHUBADDR5
// register.
//
#define USB_TXHUBADDR5_MULTTRAN 0x00000080  // Multiple Translators
#define USB_TXHUBADDR5_ADDR_M   0x0000007F  // Hub Address
#define USB_TXHUBADDR5_ADDR_S   0

//
// Defines for the bit fields in the USB_O_TXHUBPORT5
// register.
//
#define USB_TXHUBPORT5_PORT_M   0x0000007F  // Hub Port
#define USB_TXHUBPORT5_PORT_S   0

//
// Defines for the bit fields in the USB_O_RXFUNCADDR5
// register.
//
#define USB_RXFUNCADDR5_ADDR_M  0x0000007F  // Device Address
#define USB_RXFUNCADDR5_ADDR_S  0

//
// Defines for the bit fields in the USB_O_RXHUBADDR5
// register.
//
#define USB_RXHUBADDR5_MULTTRAN 0x00000080  // Multiple Translators
#define USB_RXHUBADDR5_ADDR_M   0x0000007F  // Hub Address
#define USB_RXHUBADDR5_ADDR_S   0

//
// Defines for the bit fields in the USB_O_RXHUBPORT5
// register.
//
#define USB_RXHUBPORT5_PORT_M   0x0000007F  // Hub Port
#define USB_RXHUBPORT5_PORT_S   0

//
// Defines for the bit fields in the USB_O_TXFUNCADDR6
// register.
//
#define USB_TXFUNCADDR6_ADDR_M  0x0000007F  // Device Address
#define USB_TXFUNCADDR6_ADDR_S  0

//
// Defines for the bit fields in the USB_O_TXHUBADDR6
// register.
//
#define USB_TXHUBADDR6_MULTTRAN 0x00000080  // Multiple Translators
#define USB_TXHUBADDR6_ADDR_M   0x0000007F  // Hub Address
#define USB_TXHUBADDR6_ADDR_S   0

//
// Defines for the bit fields in the USB_O_TXHUBPORT6
// register.
//
#define USB_TXHUBPORT6_PORT_M   0x0000007F  // Hub Port
#define USB_TXHUBPORT6_PORT_S   0

//
// Defines for the bit fields in the USB_O_RXFUNCADDR6
// register.
//
#define USB_RXFUNCADDR6_ADDR_M  0x0000007F  // Device Address
#define USB_RXFUNCADDR6_ADDR_S  0

//
// Defines for the bit fields in the USB_O_RXHUBADDR6
// register.
//
#define USB_RXHUBADDR6_MULTTRAN 0x00000080  // Multiple Translators
#define USB_RXHUBADDR6_ADDR_M   0x0000007F  // Hub Address
#define USB_RXHUBADDR6_ADDR_S   0

//
// Defines for the bit fields in the USB_O_RXHUBPORT6
// register.
//
#define USB_RXHUBPORT6_PORT_M   0x0000007F  // Hub Port
#define USB_RXHUBPORT6_PORT_S   0

//
// Defines for the bit fields in the USB_O_TXFUNCADDR7
// register.
//
#define USB_TXFUNCADDR7_ADDR_M  0x0000007F  // Device Address
#define USB_TXFUNCADDR7_ADDR_S  0

//
// Defines for the bit fields in the USB_O_TXHUBADDR7
// register.
//
#define USB_TXHUBADDR7_MULTTRAN 0x00000080  // Multiple Translators
#define USB_TXHUBADDR7_ADDR_M   0x0000007F  // Hub Address
#define USB_TXHUBADDR7_ADDR_S   0

//
// Defines for the bit fields in the USB_O_TXHUBPORT7
// register.
//
#define USB_TXHUBPORT7_PORT_M   0x0000007F  // Hub Port
#define USB_TXHUBPORT7_PORT_S   0

//
// Defines for the bit fields in the USB_O_RXFUNCADDR7
// register.
//
#define USB_RXFUNCADDR7_ADDR_M  0x0000007F  // Device Address
#define USB_RXFUNCADDR7_ADDR_S  0

//
// Defines for the bit fields in the USB_O_RXHUBADDR7
// register.
//
#define USB_RXHUBADDR7_MULTTRAN 0x00000080  // Multiple Translators
#define USB_RXHUBADDR7_ADDR_M   0x0000007F  // Hub Address
#define USB_RXHUBADDR7_ADDR_S   0

//
// Defines for the bit fields in the USB_O_RXHUBPORT7
// register.
//
#define USB_RXHUBPORT7_PORT_M   0x0000007F  // Hub Port
#define USB_RXHUBPORT7_PORT_S   0

//
// Defines for the bit fields in the USB_O_TXFUNCADDR8
// register.
//
#define USB_TXFUNCADDR8_ADDR_M  0x0000007F  // Device Address
#define USB_TXFUNCADDR8_ADDR_S  0

//
// Defines for the bit fields in the USB_O_TXHUBADDR8
// register.
//
#define USB_TXHUBADDR8_MULTTRAN 0x00000080  // Multiple Translators
#define USB_TXHUBADDR8_ADDR_M   0x0000007F  // Hub Address
#define USB_TXHUBADDR8_ADDR_S   0

//
// Defines for the bit fields in the USB_O_TXHUBPORT8
// register.
//
#define USB_TXHUBPORT8_PORT_M   0x0000007F  // Hub Port
#define USB_TXHUBPORT8_PORT_S   0

//
// Defines for the bit fields in the USB_O_RXFUNCADDR8
// register.
//
#define USB_RXFUNCADDR8_ADDR_M  0x0000007F  // Device Address
#define USB_RXFUNCADDR8_ADDR_S  0

//
// Defines for the bit fields in the USB_O_RXHUBADDR8
// register.
//
#define USB_RXHUBADDR8_MULTTRAN 0x00000080  // Multiple Translators
#define USB_RXHUBADDR8_ADDR_M   0x0000007F  // Hub Address
#define USB_RXHUBADDR8_ADDR_S   0

//
// Defines for the bit fields in the USB_O_RXHUBPORT8
// register.
//
#define USB_RXHUBPORT8_PORT_M   0x0000007F  // Hub Port
#define USB_RXHUBPORT8_PORT_S   0

//
// Defines for the bit fields in the USB_O_TXFUNCADDR9
// register.
//
#define USB_TXFUNCADDR9_ADDR_M  0x0000007F  // Device Address
#define USB_TXFUNCADDR9_ADDR_S  0

//
// Defines for the bit fields in the USB_O_TXHUBADDR9
// register.
//
#define USB_TXHUBADDR9_MULTTRAN 0x00000080  // Multiple Translators
#define USB_TXHUBADDR9_ADDR_M   0x0000007F  // Hub Address
#define USB_TXHUBADDR9_ADDR_S   0

//
// Defines for the bit fields in the USB_O_TXHUBPORT9
// register.
//
#define USB_TXHUBPORT9_PORT_M   0x0000007F  // Hub Port
#define USB_TXHUBPORT9_PORT_S   0

//
// Defines for the bit fields in the USB_O_RXFUNCADDR9
// register.
//
#define USB_RXFUNCADDR9_ADDR_M  0x0000007F  // Device Address
#define USB_RXFUNCADDR9_ADDR_S  0

//
// Defines for the bit fields in the USB_O_RXHUBADDR9
// register.
//
#define USB_RXHUBADDR9_MULTTRAN 0x00000080  // Multiple Translators
#define USB_RXHUBADDR9_ADDR_M   0x0000007F  // Hub Address
#define USB_RXHUBADDR9_ADDR_S   0

//
// Defines for the bit fields in the USB_O_RXHUBPORT9
// register.
//
#define USB_RXHUBPORT9_PORT_M   0x0000007F  // Hub Port
#define USB_RXHUBPORT9_PORT_S   0

//
// Defines for the bit fields in the USB_O_TXFUNCADDR10
// register.
//
#define USB_TXFUNCADDR10_ADDR_M 0x0000007F  // Device Address
#define USB_TXFUNCADDR10_ADDR_S 0

//
// Defines for the bit fields in the USB_O_TXHUBADDR10
// register.
//
#define USB_TXHUBADDR10_MULTTRAN 0x00000080  // Multiple Translators
#define USB_TXHUBADDR10_ADDR_M  0x0000007F  // Hub Address
#define USB_TXHUBADDR10_ADDR_S  0

//
// Defines for the bit fields in the USB_O_TXHUBPORT10
// register.
//
#define USB_TXHUBPORT10_PORT_M  0x0000007F  // Hub Port
#define USB_TXHUBPORT10_PORT_S  0

//
// Defines for the bit fields in the USB_O_RXFUNCADDR10
// register.
//
#define USB_RXFUNCADDR10_ADDR_M 0x0000007F  // Device Address
#define USB_RXFUNCADDR10_ADDR_S 0

//
// Defines for the bit fields in the USB_O_RXHUBADDR10
// register.
//
#define USB_RXHUBADDR10_MULTTRAN 0x00000080  // Multiple Translators
#define USB_RXHUBADDR10_ADDR_M  0x0000007F  // Hub Address
#define USB_RXHUBADDR10_ADDR_S  0

//
// Defines for the bit fields in the USB_O_RXHUBPORT10
// register.
//
#define USB_RXHUBPORT10_PORT_M  0x0000007F  // Hub Port
#define USB_RXHUBPORT10_PORT_S  0

//
// Defines for the bit fields in the USB_O_TXFUNCADDR11
// register.
//
#define USB_TXFUNCADDR11_ADDR_M 0x0000007F  // Device Address
#define USB_TXFUNCADDR11_ADDR_S 0

//
// Defines for the bit fields in the USB_O_TXHUBADDR11
// register.
//
#define USB_TXHUBADDR11_MULTTRAN 0x00000080  // Multiple Translators
#define USB_TXHUBADDR11_ADDR_M  0x0000007F  // Hub Address
#define USB_TXHUBADDR11_ADDR_S  0

//
// Defines for the bit fields in the USB_O_TXHUBPORT11
// register.
//
#define USB_TXHUBPORT11_PORT_M  0x0000007F  // Hub Port
#define USB_TXHUBPORT11_PORT_S  0

//
// Defines for the bit fields in the USB_O_RXFUNCADDR11
// register.
//
#define USB_RXFUNCADDR11_ADDR_M 0x0000007F  // Device Address
#define USB_RXFUNCADDR11_ADDR_S 0

//
// Defines for the bit fields in the USB_O_RXHUBADDR11
// register.
//
#define USB_RXHUBADDR11_MULTTRAN 0x00000080  // Multiple Translators
#define USB_RXHUBADDR11_ADDR_M  0x0000007F  // Hub Address
#define USB_RXHUBADDR11_ADDR_S  0

//
// Defines for the bit fields in the USB_O_RXHUBPORT11
// register.
//
#define USB_RXHUBPORT11_PORT_M  0x0000007F  // Hub Port
#define USB_RXHUBPORT11_PORT_S  0

//
// Defines for the bit fields in the USB_O_TXFUNCADDR12
// register.
//
#define USB_TXFUNCADDR12_ADDR_M 0x0000007F  // Device Address
#define USB_TXFUNCADDR12_ADDR_S 0

//
// Defines for the bit fields in the USB_O_TXHUBADDR12
// register.
//
#define USB_TXHUBADDR12_MULTTRAN 0x00000080  // Multiple Translators
#define USB_TXHUBADDR12_ADDR_M  0x0000007F  // Hub Address
#define USB_TXHUBADDR12_ADDR_S  0

//
// Defines for the bit fields in the USB_O_TXHUBPORT12
// register.
//
#define USB_TXHUBPORT12_PORT_M  0x0000007F  // Hub Port
#define USB_TXHUBPORT12_PORT_S  0

//
// Defines for the bit fields in the USB_O_RXFUNCADDR12
// register.
//
#define USB_RXFUNCADDR12_ADDR_M 0x0000007F  // Device Address
#define USB_RXFUNCADDR12_ADDR_S 0

//
// Defines for the bit fields in the USB_O_RXHUBADDR12
// register.
//
#define USB_RXHUBADDR12_MULTTRAN 0x00000080  // Multiple Translators
#define USB_RXHUBADDR12_ADDR_M  0x0000007F  // Hub Address
#define USB_RXHUBADDR12_ADDR_S  0

//
// Defines for the bit fields in the USB_O_RXHUBPORT12
// register.
//
#define USB_RXHUBPORT12_PORT_M  0x0000007F  // Hub Port
#define USB_RXHUBPORT12_PORT_S  0

//
// Defines for the bit fields in the USB_O_TXFUNCADDR13
// register.
//
#define USB_TXFUNCADDR13_ADDR_M 0x0000007F  // Device Address
#define USB_TXFUNCADDR13_ADDR_S 0

//
// Defines for the bit fields in the USB_O_TXHUBADDR13
// register.
//
#define USB_TXHUBADDR13_MULTTRAN 0x00000080  // Multiple Translators
#define USB_TXHUBADDR13_ADDR_M  0x0000007F  // Hub Address
#define USB_TXHUBADDR13_ADDR_S  0

//
// Defines for the bit fields in the USB_O_TXHUBPORT13
// register.
//
#define USB_TXHUBPORT13_PORT_M  0x0000007F  // Hub Port
#define USB_TXHUBPORT13_PORT_S  0

//
// Defines for the bit fields in the USB_O_RXFUNCADDR13
// register.
//
#define USB_RXFUNCADDR13_ADDR_M 0x0000007F  // Device Address
#define USB_RXFUNCADDR13_ADDR_S 0

//
// Defines for the bit fields in the USB_O_RXHUBADDR13
// register.
//
#define USB_RXHUBADDR13_MULTTRAN 0x00000080  // Multiple Translators
#define USB_RXHUBADDR13_ADDR_M  0x0000007F  // Hub Address
#define USB_RXHUBADDR13_ADDR_S  0

//
// Defines for the bit fields in the USB_O_RXHUBPORT13
// register.
//
#define USB_RXHUBPORT13_PORT_M  0x0000007F  // Hub Port
#define USB_RXHUBPORT13_PORT_S  0

//
// Defines for the bit fields in the USB_O_TXFUNCADDR14
// register.
//
#define USB_TXFUNCADDR14_ADDR_M 0x0000007F  // Device Address
#define USB_TXFUNCADDR14_ADDR_S 0

//
// Defines for the bit fields in the USB_O_TXHUBADDR14
// register.
//
#define USB_TXHUBADDR14_MULTTRAN 0x00000080  // Multiple Translators
#define USB_TXHUBADDR14_ADDR_M  0x0000007F  // Hub Address
#define USB_TXHUBADDR14_ADDR_S  0

//
// Defines for the bit fields in the USB_O_TXHUBPORT14
// register.
//
#define USB_TXHUBPORT14_PORT_M  0x0000007F  // Hub Port
#define USB_TXHUBPORT14_PORT_S  0

//
// Defines for the bit fields in the USB_O_RXFUNCADDR14
// register.
//
#define USB_RXFUNCADDR14_ADDR_M 0x0000007F  // Device Address
#define USB_RXFUNCADDR14_ADDR_S 0

//
// Defines for the bit fields in the USB_O_RXHUBADDR14
// register.
//
#define USB_RXHUBADDR14_MULTTRAN 0x00000080  // Multiple Translators
#define USB_RXHUBADDR14_ADDR_M  0x0000007F  // Hub Address
#define USB_RXHUBADDR14_ADDR_S  0

//
// Defines for the bit fields in the USB_O_RXHUBPORT14
// register.
//
#define USB_RXHUBPORT14_PORT_M  0x0000007F  // Hub Port
#define USB_RXHUBPORT14_PORT_S  0

//
// Defines for the bit fields in the USB_O_TXFUNCADDR15
// register.
//
#define USB_TXFUNCADDR15_ADDR_M 0x0000007F  // Device Address
#define USB_TXFUNCADDR15_ADDR_S 0

//
// Defines for the bit fields in the USB_O_TXHUBADDR15
// register.
//
#define USB_TXHUBADDR15_MULTTRAN 0x00000080  // Multiple Translators
#define USB_TXHUBADDR15_ADDR_M  0x0000007F  // Hub Address
#define USB_TXHUBADDR15_ADDR_S  0

//
// Defines for the bit fields in the USB_O_TXHUBPORT15
// register.
//
#define USB_TXHUBPORT15_PORT_M  0x0000007F  // Hub Port
#define USB_TXHUBPORT15_PORT_S  0

//
// Defines for the bit fields in the USB_O_RXFUNCADDR15
// register.
//
#define USB_RXFUNCADDR15_ADDR_M 0x0000007F  // Device Address
#define USB_RXFUNCADDR15_ADDR_S 0

//
// Defines for the bit fields in the USB_O_RXHUBADDR15
// register.
//
#define USB_RXHUBADDR15_MULTTRAN 0x00000080  // Multiple Translators
#define USB_RXHUBADDR15_ADDR_M  0x0000007F  // Hub Address
#define USB_RXHUBADDR15_ADDR_S  0

//
// Defines for the bit fields in the USB_O_RXHUBPORT15
// register.
//
#define USB_RXHUBPORT15_PORT_M  0x0000007F  // Hub Port
#define USB_RXHUBPORT15_PORT_S  0

//
// Defines for the bit fields in the USB_O_CSRL0 register.
//
#define USB_CSRL0_NAKTO         0x00000080  // NAK Timeout
#define USB_CSRL0_SETENDC       0x00000080  // Setup End Clear
#define USB_CSRL0_STATUS        0x00000040  // STATUS Packet
#define USB_CSRL0_RXRDYC        0x00000040  // RXRDY Clear
#define USB_CSRL0_REQPKT        0x00000020  // Request Packet
#define USB_CSRL0_STALL         0x00000020  // Send Stall
#define USB_CSRL0_SETEND        0x00000010  // Setup End
#define USB_CSRL0_ERROR         0x00000010  // Error
#define USB_CSRL0_DATAEND       0x00000008  // Data End
#define USB_CSRL0_SETUP         0x00000008  // Setup Packet
#define USB_CSRL0_STALLED       0x00000004  // Endpoint Stalled
#define USB_CSRL0_TXRDY         0x00000002  // Transmit Packet Ready
#define USB_CSRL0_RXRDY         0x00000001  // Receive Packet Ready

//
// Defines for the bit fields in the USB_O_CSRH0 register.
//
#define USB_CSRH0_DTWE          0x00000004  // Data Toggle Write Enable
#define USB_CSRH0_DT            0x00000002  // Data Toggle
#define USB_CSRH0_FLUSH         0x00000001  // Flush FIFO

//
// Defines for the bit fields in the USB_O_COUNT0 register.
//
#define USB_COUNT0_COUNT_M      0x0000007F  // FIFO Count
#define USB_COUNT0_COUNT_S      0

//
// Defines for the bit fields in the USB_O_TYPE0 register.
//
#define USB_TYPE0_SPEED_M       0x000000C0  // Operating Speed
#define USB_TYPE0_SPEED_FULL    0x00000080  // Full
#define USB_TYPE0_SPEED_LOW     0x000000C0  // Low

//
// Defines for the bit fields in the USB_O_NAKLMT register.
//
#define USB_NAKLMT_NAKLMT_M     0x0000001F  // EP0 NAK Limit
#define USB_NAKLMT_NAKLMT_S     0

//
// Defines for the bit fields in the USB_O_TXMAXP1 register.
//
#define USB_TXMAXP1_MAXLOAD_M   0x000007FF  // Maximum Payload
#define USB_TXMAXP1_MAXLOAD_S   0

//
// Defines for the bit fields in the USB_O_TXCSRL1 register.
//
#define USB_TXCSRL1_NAKTO       0x00000080  // NAK Timeout
#define USB_TXCSRL1_CLRDT       0x00000040  // Clear Data Toggle
#define USB_TXCSRL1_STALLED     0x00000020  // Endpoint Stalled
#define USB_TXCSRL1_STALL       0x00000010  // Send STALL
#define USB_TXCSRL1_SETUP       0x00000010  // Setup Packet
#define USB_TXCSRL1_FLUSH       0x00000008  // Flush FIFO
#define USB_TXCSRL1_ERROR       0x00000004  // Error
#define USB_TXCSRL1_UNDRN       0x00000004  // Underrun
#define USB_TXCSRL1_FIFONE      0x00000002  // FIFO Not Empty
#define USB_TXCSRL1_TXRDY       0x00000001  // Transmit Packet Ready

//
// Defines for the bit fields in the USB_O_TXCSRH1 register.
//
#define USB_TXCSRH1_AUTOSET     0x00000080  // Auto Set
#define USB_TXCSRH1_ISO         0x00000040  // Isochronous Transfers
#define USB_TXCSRH1_MODE        0x00000020  // Mode
#define USB_TXCSRH1_DMAEN       0x00000010  // DMA Request Enable
#define USB_TXCSRH1_FDT         0x00000008  // Force Data Toggle
#define USB_TXCSRH1_DMAMOD      0x00000004  // DMA Request Mode
#define USB_TXCSRH1_DTWE        0x00000002  // Data Toggle Write Enable
#define USB_TXCSRH1_DT          0x00000001  // Data Toggle

//
// Defines for the bit fields in the USB_O_RXMAXP1 register.
//
#define USB_RXMAXP1_MAXLOAD_M   0x000007FF  // Maximum Payload
#define USB_RXMAXP1_MAXLOAD_S   0

//
// Defines for the bit fields in the USB_O_RXCSRL1 register.
//
#define USB_RXCSRL1_CLRDT       0x00000080  // Clear Data Toggle
#define USB_RXCSRL1_STALLED     0x00000040  // Endpoint Stalled
#define USB_RXCSRL1_STALL       0x00000020  // Send STALL
#define USB_RXCSRL1_REQPKT      0x00000020  // Request Packet
#define USB_RXCSRL1_FLUSH       0x00000010  // Flush FIFO
#define USB_RXCSRL1_DATAERR     0x00000008  // Data Error
#define USB_RXCSRL1_NAKTO       0x00000008  // NAK Timeout
#define USB_RXCSRL1_OVER        0x00000004  // Overrun
#define USB_RXCSRL1_ERROR       0x00000004  // Error
#define USB_RXCSRL1_FULL        0x00000002  // FIFO Full
#define USB_RXCSRL1_RXRDY       0x00000001  // Receive Packet Ready

//
// Defines for the bit fields in the USB_O_RXCSRH1 register.
//
#define USB_RXCSRH1_AUTOCL      0x00000080  // Auto Clear
#define USB_RXCSRH1_AUTORQ      0x00000040  // Auto Request
#define USB_RXCSRH1_ISO         0x00000040  // Isochronous Transfers
#define USB_RXCSRH1_DMAEN       0x00000020  // DMA Request Enable
#define USB_RXCSRH1_DISNYET     0x00000010  // Disable NYET
#define USB_RXCSRH1_PIDERR      0x00000010  // PID Error
#define USB_RXCSRH1_DMAMOD      0x00000008  // DMA Request Mode
#define USB_RXCSRH1_DTWE        0x00000004  // Data Toggle Write Enable
#define USB_RXCSRH1_DT          0x00000002  // Data Toggle

//
// Defines for the bit fields in the USB_O_RXCOUNT1 register.
//
#define USB_RXCOUNT1_COUNT_M    0x00001FFF  // Receive Packet Count
#define USB_RXCOUNT1_COUNT_S    0

//
// Defines for the bit fields in the USB_O_TXTYPE1 register.
//
#define USB_TXTYPE1_SPEED_M     0x000000C0  // Operating Speed
#define USB_TXTYPE1_SPEED_DFLT  0x00000000  // Default
#define USB_TXTYPE1_SPEED_FULL  0x00000080  // Full
#define USB_TXTYPE1_SPEED_LOW   0x000000C0  // Low
#define USB_TXTYPE1_PROTO_M     0x00000030  // Protocol
#define USB_TXTYPE1_PROTO_CTRL  0x00000000  // Control
#define USB_TXTYPE1_PROTO_ISOC  0x00000010  // Isochronous
#define USB_TXTYPE1_PROTO_BULK  0x00000020  // Bulk
#define USB_TXTYPE1_PROTO_INT   0x00000030  // Interrupt
#define USB_TXTYPE1_TEP_M       0x0000000F  // Target Endpoint Number
#define USB_TXTYPE1_TEP_S       0

//
// Defines for the bit fields in the USB_O_TXINTERVAL1
// register.
//
#define USB_TXINTERVAL1_NAKLMT_M 0x000000FF  // NAK Limit
#define USB_TXINTERVAL1_TXPOLL_M 0x000000FF  // TX Polling
#define USB_TXINTERVAL1_TXPOLL_S 0
#define USB_TXINTERVAL1_NAKLMT_S 0

//
// Defines for the bit fields in the USB_O_RXTYPE1 register.
//
#define USB_RXTYPE1_SPEED_M     0x000000C0  // Operating Speed
#define USB_RXTYPE1_SPEED_DFLT  0x00000000  // Default
#define USB_RXTYPE1_SPEED_FULL  0x00000080  // Full
#define USB_RXTYPE1_SPEED_LOW   0x000000C0  // Low
#define USB_RXTYPE1_PROTO_M     0x00000030  // Protocol
#define USB_RXTYPE1_PROTO_CTRL  0x00000000  // Control
#define USB_RXTYPE1_PROTO_ISOC  0x00000010  // Isochronous
#define USB_RXTYPE1_PROTO_BULK  0x00000020  // Bulk
#define USB_RXTYPE1_PROTO_INT   0x00000030  // Interrupt
#define USB_RXTYPE1_TEP_M       0x0000000F  // Target Endpoint Number
#define USB_RXTYPE1_TEP_S       0

//
// Defines for the bit fields in the USB_O_RXINTERVAL1
// register.
//
#define USB_RXINTERVAL1_TXPOLL_M 0x000000FF  // RX Polling
#define USB_RXINTERVAL1_NAKLMT_M 0x000000FF  // NAK Limit
#define USB_RXINTERVAL1_TXPOLL_S 0
#define USB_RXINTERVAL1_NAKLMT_S 0

//
// Defines for the bit fields in the USB_O_TXMAXP2 register.
//
#define USB_TXMAXP2_MAXLOAD_M   0x000007FF  // Maximum Payload
#define USB_TXMAXP2_MAXLOAD_S   0

//
// Defines for the bit fields in the USB_O_TXCSRL2 register.
//
#define USB_TXCSRL2_NAKTO       0x00000080  // NAK Timeout
#define USB_TXCSRL2_CLRDT       0x00000040  // Clear Data Toggle
#define USB_TXCSRL2_STALLED     0x00000020  // Endpoint Stalled
#define USB_TXCSRL2_SETUP       0x00000010  // Setup Packet
#define USB_TXCSRL2_STALL       0x00000010  // Send STALL
#define USB_TXCSRL2_FLUSH       0x00000008  // Flush FIFO
#define USB_TXCSRL2_ERROR       0x00000004  // Error
#define USB_TXCSRL2_UNDRN       0x00000004  // Underrun
#define USB_TXCSRL2_FIFONE      0x00000002  // FIFO Not Empty
#define USB_TXCSRL2_TXRDY       0x00000001  // Transmit Packet Ready

//
// Defines for the bit fields in the USB_O_TXCSRH2 register.
//
#define USB_TXCSRH2_AUTOSET     0x00000080  // Auto Set
#define USB_TXCSRH2_ISO         0x00000040  // Isochronous Transfers
#define USB_TXCSRH2_MODE        0x00000020  // Mode
#define USB_TXCSRH2_DMAEN       0x00000010  // DMA Request Enable
#define USB_TXCSRH2_FDT         0x00000008  // Force Data Toggle
#define USB_TXCSRH2_DMAMOD      0x00000004  // DMA Request Mode
#define USB_TXCSRH2_DTWE        0x00000002  // Data Toggle Write Enable
#define USB_TXCSRH2_DT          0x00000001  // Data Toggle

//
// Defines for the bit fields in the USB_O_RXMAXP2 register.
//
#define USB_RXMAXP2_MAXLOAD_M   0x000007FF  // Maximum Payload
#define USB_RXMAXP2_MAXLOAD_S   0

//
// Defines for the bit fields in the USB_O_RXCSRL2 register.
//
#define USB_RXCSRL2_CLRDT       0x00000080  // Clear Data Toggle
#define USB_RXCSRL2_STALLED     0x00000040  // Endpoint Stalled
#define USB_RXCSRL2_REQPKT      0x00000020  // Request Packet
#define USB_RXCSRL2_STALL       0x00000020  // Send STALL
#define USB_RXCSRL2_FLUSH       0x00000010  // Flush FIFO
#define USB_RXCSRL2_DATAERR     0x00000008  // Data Error
#define USB_RXCSRL2_NAKTO       0x00000008  // NAK Timeout
#define USB_RXCSRL2_ERROR       0x00000004  // Error
#define USB_RXCSRL2_OVER        0x00000004  // Overrun
#define USB_RXCSRL2_FULL        0x00000002  // FIFO Full
#define USB_RXCSRL2_RXRDY       0x00000001  // Receive Packet Ready

